In [2]:
import pandas as pd
import numpy as np
from useful_code.generate_dataset import generate_numeric_df, get_example_cat_dfs

In [3]:
import random
import pandas as pd
import numpy as np
from random import shuffle

def generate_numeric_df(num_rows: int, cols:str, index_start:int=0, seed:int=101):
    cols_lst = [c for c in cols]
    np.random.seed(seed)
    return pd.DataFrame({col: [np.random.randn() for _ in range(num_rows)] for col in cols_lst
},  index = range(index_start, index_start + num_rows))


def get_example_cat_dfs(shuff=True):
    students = ['Jana', 'Sofie', 'Maaike', 'Dirk', 'Annabel']
    df1 = pd.DataFrame({'student': students,
                         'werkgever':['Delhaize', 'Google', 'Delhaize', 'LG', 'Delhaize']})

    if shuff:
        shuffle(students)

    df2 = pd.DataFrame({'student': students,
                  'jaar_opleiding': [2012, 2025, 2013, 2022, 2019]})

    df3 = pd.DataFrame({'werkgever':['Delhaize', 'Google', 'LG'],
                        'land hoofdzetel': ['Belgie', 'VS', 'Zuid-Korea'],
                        },

                       )

    df4 = pd.DataFrame({'klant': students,
                        'kostprijs': [998, 663, 998, 0, 898],
                         },

                    )

    df5 = pd.DataFrame({
        'student': ['Jana', 'Sofie', 'Maaike', 'Dirk', 'Annabel', 'Sofie'],
        'module': ['1.Python Basics', 'Eindexamen: Data Science', '1.Python Basics', '2.SQL Essentials', '3.Web Scraping',
                   '2.SQL Essentials'],
        'resultaat': [14, 18, 12, 16, 15, 19],
        'behaald': [True, True, True, True, True, True],
        'jaar': [2012, 2025, 2012, 2014, 2019, 2014],

    })

    df6 = pd.DataFrame({
        'student': [
            'Jana', 'Sofie', 'Maaike', 'Dirk', 'Annabel',
            'Tom', 'Lena', 'Wout', 'Hanna', 'Bram'
        ],
        'jaar': [
            9999, 2025, 9999, 9999, 9999,
            2020, 2024, 2021, 2018, 2017
        ],
        'start_salaris': [
            3200, 4100, 3000, 3800, 3500,
            2900, 4000, 3600, 3300, 3400
        ],
        'sector': [
            'Retail', 'Tech', 'Retail', 'Tech', 'Retail',
            'Retail', 'Tech', 'Tech', 'Logistiek', 'Retail'
        ]
    })

    df7 = pd.DataFrame({'studentnr': range(1,10),
                        'inlogcode': [random.randint(1000, 9999) for _ in range(1,10)]
                         },

                    index=range(1,10))

    return df1, df2, df3, df4, df5, df6, df7

In [4]:
studenten, inschrijvingen, werkgevers, boekhouding, classes, alumni, inlogcodes = get_example_cat_dfs()

In [5]:
studenten.head()

   student werkgever
0     Jana  Delhaize
1    Sofie    Google
2   Maaike  Delhaize
3     Dirk        LG
4  Annabel  Delhaize

## 1. Concat
Samenvoegen verschillende datasets/ aan elkaar plakken

In [7]:
df1 = generate_numeric_df(4, 'ABCDE')
df2 = generate_numeric_df(4, 'ABCDE', seed=5, index_start=4)

In [9]:
df2.head()

          A         B         C         D         E
4  0.441227  0.109610  0.187603 -0.358829  1.151391
5 -0.330870  1.582481 -0.329870  0.603472  1.857331
6  2.430771 -0.909232 -1.192765 -1.664789 -1.511180
7 -0.252092 -0.591637 -0.204877 -0.700179  0.644848

In [10]:
new_df = pd.concat([df1, df2])
new_df

          A         B         C         D         E
0  2.706850  0.651118 -2.018168  0.188695  0.190794
1  0.628133 -0.319318  0.740122 -0.758872  1.978757
2  0.907969 -0.848077  0.528813 -0.933237  2.605967
3  0.503826  0.605965 -0.589001  0.955057  0.683509
4  0.441227  0.109610  0.187603 -0.358829  1.151391
5 -0.330870  1.582481 -0.329870  0.603472  1.857331
6  2.430771 -0.909232 -1.192765 -1.664789 -1.511180
7 -0.252092 -0.591637 -0.204877 -0.700179  0.644848

In [12]:
df1 = generate_numeric_df(4, 'ABCDE')
df2 = generate_numeric_df(4, 'ABCDE', seed=5)
new_df = pd.concat([df1, df2])
new_df

          A         B         C         D         E
0  2.706850  0.651118 -2.018168  0.188695  0.190794
1  0.628133 -0.319318  0.740122 -0.758872  1.978757
2  0.907969 -0.848077  0.528813 -0.933237  2.605967
3  0.503826  0.605965 -0.589001  0.955057  0.683509
0  0.441227  0.109610  0.187603 -0.358829  1.151391
1 -0.330870  1.582481 -0.329870  0.603472  1.857331
2  2.430771 -0.909232 -1.192765 -1.664789 -1.511180
3 -0.252092 -0.591637 -0.204877 -0.700179  0.644848

In [13]:
new_df.loc[0]

          A         B         C         D         E
0  2.706850  0.651118 -2.018168  0.188695  0.190794
0  0.441227  0.109610  0.187603 -0.358829  1.151391

In [14]:
pd.concat([df1, df2], verify_integrity=True)

ValueError: Indexes have overlapping values: Index([0, 1, 2, 3], dtype='int64')

In [16]:
new_df = pd.concat([df1, df2], ignore_index=True)
new_df

          A         B         C         D         E
0  2.706850  0.651118 -2.018168  0.188695  0.190794
1  0.628133 -0.319318  0.740122 -0.758872  1.978757
2  0.907969 -0.848077  0.528813 -0.933237  2.605967
3  0.503826  0.605965 -0.589001  0.955057  0.683509
4  0.441227  0.109610  0.187603 -0.358829  1.151391
5 -0.330870  1.582481 -0.329870  0.603472  1.857331
6  2.430771 -0.909232 -1.192765 -1.664789 -1.511180
7 -0.252092 -0.591637 -0.204877 -0.700179  0.644848

In [19]:
new_df.loc[0]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: 0, dtype: float64

### 1.1 duplicate indexes
Concat preserves indexes, plakt gewoon

### 1.2 Join-parameter
Stel: je Dataframes hebben verschillende kolomnamen

In [20]:
df1 = generate_numeric_df(4, 'ABCDE')
df2 = generate_numeric_df(4, 'DEFGH', seed=5)
df2.head()

          D         E         F         G         H
0  0.441227  0.109610  0.187603 -0.358829  1.151391
1 -0.330870  1.582481 -0.329870  0.603472  1.857331
2  2.430771 -0.909232 -1.192765 -1.664789 -1.511180
3 -0.252092 -0.591637 -0.204877 -0.700179  0.644848

In [22]:
new_df = pd.concat([df1, df2])
new_df

,A,B,C,D,E,F,G,H
0,2.706850,0.651118,-2.018168,0.188695,0.190794,NaN,NaN,NaN
1,0.628133,-0.319318,0.740122,-0.758872,1.978757,NaN,NaN,NaN
2,0.907969,-0.848077,0.528813,-0.933237,2.605967,NaN,NaN,NaN
3,0.503826,0.605965,-0.589001,0.955057,0.683509,NaN,NaN,NaN
0,NaN,NaN,NaN,0.441227,0.109610,0.187603,-0.358829,1.151391
1,NaN,NaN,NaN,-0.330870,1.582481,-0.329870,0.603472,1.857331
2,NaN,NaN,NaN,2.430771,-0.909232,-1.192765,-1.664789,-1.511180
3,NaN,NaN,NaN,-0.252092,-0.591637,-0.204877,-0.700179,0.644848

In [29]:
new_df = pd.concat([df1, df2], join='inner')
new_df

          D         E
0  0.188695  0.190794
1 -0.758872  1.978757
2 -0.933237  2.605967
3  0.955057  0.683509
0  0.441227  0.109610
1 -0.330870  1.582481
2  2.430771 -0.909232
3 -0.252092 -0.591637

### 1.3 Concat for n DataFrames

In [30]:
df1 = generate_numeric_df(4, 'ABCDE')
df2 = generate_numeric_df(4, 'ABCDE', seed=6)
df3 = generate_numeric_df(4, 'ABCDE', seed=5)

In [31]:
pd.concat([df1, df2, df3])

          A         B         C         D         E
0  2.706850  0.651118 -2.018168  0.188695  0.190794
1  0.628133 -0.319318  0.740122 -0.758872  1.978757
2  0.907969 -0.848077  0.528813 -0.933237  2.605967
3  0.503826  0.605965 -0.589001  0.955057  0.683509
0 -0.311784 -2.486781  1.639291 -0.335882  0.076128
1  0.729004  0.913252 -0.429894  1.237738 -0.155128
2  0.217821  1.127064  2.631281  0.111128  0.634225
3 -0.899092 -1.514093  0.601822  0.129151  0.810655
0  0.441227  0.109610  0.187603 -0.358829  1.151391
1 -0.330870  1.582481 -0.329870  0.603472  1.857331
2  2.430771 -0.909232 -1.192765 -1.664789 -1.511180
3 -0.252092 -0.591637 -0.204877 -0.700179  0.644848

## 2. Merge
- zoals joins in SQL

### 2.1 One-to-one

In [32]:
studenten

   student werkgever
0     Jana  Delhaize
1    Sofie    Google
2   Maaike  Delhaize
3     Dirk        LG
4  Annabel  Delhaize

In [33]:
inschrijvingen

   student  jaar_opleiding
0     Jana            2012
1  Annabel            2025
2    Sofie            2013
3   Maaike            2022
4     Dirk            2019

In [34]:
studenten.merge(inschrijvingen, on='student')

   student werkgever  jaar_opleiding
0     Jana  Delhaize            2012
1    Sofie    Google            2013
2   Maaike  Delhaize            2022
3     Dirk        LG            2019
4  Annabel  Delhaize            2025

In [35]:
pd.merge(studenten, inschrijvingen, on='student')

   student werkgever  jaar_opleiding
0     Jana  Delhaize            2012
1    Sofie    Google            2013
2   Maaike  Delhaize            2022
3     Dirk        LG            2019
4  Annabel  Delhaize            2025

In [36]:
studenten.merge(inschrijvingen)

   student werkgever  jaar_opleiding
0     Jana  Delhaize            2012
1    Sofie    Google            2013
2   Maaike  Delhaize            2022
3     Dirk        LG            2019
4  Annabel  Delhaize            2025

### 2.2 Many-to-one

In [37]:
werkgevers

  werkgever land hoofdzetel
0  Delhaize          Belgie
1    Google              VS
2        LG      Zuid-Korea

In [38]:
studenten.merge(werkgevers, on='werkgever')

   student werkgever land hoofdzetel
0     Jana  Delhaize          Belgie
1    Sofie    Google              VS
2   Maaike  Delhaize          Belgie
3     Dirk        LG      Zuid-Korea
4  Annabel  Delhaize          Belgie

### 2.3 Afwijkende Kolomnamen

In [39]:
studenten

   student werkgever
0     Jana  Delhaize
1    Sofie    Google
2   Maaike  Delhaize
3     Dirk        LG
4  Annabel  Delhaize

In [40]:
boekhouding

     klant  kostprijs
0     Jana        998
1  Annabel        663
2    Sofie        998
3   Maaike          0
4     Dirk        898

In [42]:
df = studenten.merge(boekhouding, left_on='student', right_on='klant').drop('klant', axis=1)

   student werkgever  kostprijs
0     Jana  Delhaize        998
1    Sofie    Google        998
2   Maaike  Delhaize          0
3     Dirk        LG        898
4  Annabel  Delhaize        663

### 2.4 Meerdere merge-keys

In [43]:
classes

   student                    module  resultaat  behaald  jaar
0     Jana           1.Python Basics         14     True  2012
1    Sofie  Eindexamen: Data Science         18     True  2025
2   Maaike           1.Python Basics         12     True  2012
3     Dirk          2.SQL Essentials         16     True  2014
4  Annabel            3.Web Scraping         15     True  2019
5    Sofie          2.SQL Essentials         19     True  2014

In [44]:
alumni

   student  jaar  start_salaris     sector
0     Jana  9999           3200     Retail
1    Sofie  2025           4100       Tech
2   Maaike  9999           3000     Retail
3     Dirk  9999           3800       Tech
4  Annabel  9999           3500     Retail
5      Tom  2020           2900     Retail
6     Lena  2024           4000       Tech
7     Wout  2021           3600       Tech
8    Hanna  2018           3300  Logistiek
9     Bram  2017           3400     Retail

In [47]:
df = classes.merge(alumni, on='student')

In [51]:
classes.merge(alumni, on=['student', 'jaar'], how='left')

,student,module,resultaat,behaald,jaar,start_salaris,sector
0,Jana,1.Python Basics,14,True,2012,NaN,NaN
1,Sofie,Eindexamen: Data Science,18,True,2025,4100.0,Tech
2,Maaike,1.Python Basics,12,True,2012,NaN,NaN
3,Dirk,2.SQL Essentials,16,True,2014,NaN,NaN
4,Annabel,3.Web Scraping,15,True,2019,NaN,NaN
5,Sofie,2.SQL Essentials,19,True,2014,NaN,NaN

In [52]:
classes.merge(alumni, on='student', suffixes=('_classes', '_alumni'))

,student,module,resultaat,behaald,jaar_classes,jaar_alumni,start_salaris,sector
0,Jana,1.Python Basics,14,True,2012,9999,3200,Retail
1,Sofie,Eindexamen: Data Science,18,True,2025,2025,4100,Tech
2,Maaike,1.Python Basics,12,True,2012,9999,3000,Retail
3,Dirk,2.SQL Essentials,16,True,2014,9999,3800,Tech
4,Annabel,3.Web Scraping,15,True,2019,9999,3500,Retail
5,Sofie,2.SQL Essentials,19,True,2014,2025,4100,Tech

In [53]:
alum_class = classes.merge(alumni, on='student')
df = alum_class.merge(studenten, on='student')

,student,module,resultaat,behaald,jaar_x,jaar_y,start_salaris,sector,werkgever
0,Jana,1.Python Basics,14,True,2012,9999,3200,Retail,Delhaize
1,Sofie,Eindexamen: Data Science,18,True,2025,2025,4100,Tech,Google
2,Maaike,1.Python Basics,12,True,2012,9999,3000,Retail,Delhaize
3,Dirk,2.SQL Essentials,16,True,2014,9999,3800,Tech,LG
4,Annabel,3.Web Scraping,15,True,2019,9999,3500,Retail,Delhaize
5,Sofie,2.SQL Essentials,19,True,2014,2025,4100,Tech,Google

## 3. Joining
Combineren op index ipv kolom, default left

In [54]:
studenten

   student werkgever
0     Jana  Delhaize
1    Sofie    Google
2   Maaike  Delhaize
3     Dirk        LG
4  Annabel  Delhaize

In [55]:
inlogcodes

   studentnr  inlogcode
1          1       9519
2          2       4669
3          3       8445
4          4       5851
5          5       8935
6          6       3805
7          7       7900
8          8       9066
9          9       2626

In [56]:
studenten.join(inlogcodes)

   student werkgever  studentnr  inlogcode
0     Jana  Delhaize        NaN        NaN
1    Sofie    Google        1.0     9519.0
2   Maaike  Delhaize        2.0     4669.0
3     Dirk        LG        3.0     8445.0
4  Annabel  Delhaize        4.0     5851.0